In [2]:
import pandas as pd

In [ ]:

#series DS 1D# labeled Array
s=pd.Series([20,40,60])
print(s)

0    20
1    40
2    60
dtype: int64

In [16]:
s=pd.Series([20,40,50],index=(1,2,3))
print(s)

1    20
2    40
3    50
dtype: int64

In [7]:
s=pd.Series([10,20,30,40,60],index=('a','b','c','d','e'))
print(s)

a    10
b    20
c    30
d    40
e    60
dtype: int64

In [9]:
# 1d=series operations 

#pandas

#2d labeled data structure(rows & columns)

df=pd.DataFrame({'arr':["sumit" ,"shubham","shivam","sahil"],'age' :[ 21,33,25,12]},index=('1','2','3','4'))
print(df)
print(df)

       arr  age
1    sumit   21
2  shubham   33
3   shivam   25
4    sahil   12
       arr  age
1    sumit   21
2  shubham   33
3   shivam   25
4    sahil   12

In [36]:
#dictonary, lists, list of dict, numpy array
#from dictonary
df=pd.DataFrame({'x':[1,2,3],'y':[4,5,6]},index=('a','b','c'))
print(df)

   x  y
a  1  4
b  2  5
c  3  6

In [43]:
#from list
df=pd.DataFrame(([1,2],[3,4]))
print(df)
print(df[0])
print(df[1])

   0  1
0  1  2
1  3  4
0    1
1    3
Name: 0, dtype: int64
0    2
1    4
Name: 1, dtype: int64

In [45]:
df=pd.DataFrame(([{'A':1,'B':2},{'A':3,'B':4}]))
print(df)

   A  B
0  1  2
1  3  4

In [3]:
# from numpy array
import numpy as np 
df = pd.DataFrame(np.arange(9).reshape(3,3), columns = ['A', 'B', 'c'])
print(df)

   A  B  c
0  0  1  2
1  3  4  5
2  6  7  8

In [ ]:
# csv
# Excel
# Json
#SQL
#HTML

In [4]:
# read_csv
# to_csv
df = pd.read_csv('C:\\Users\\sri44\\Desktop\\Pandas\\House_Rent_Dataset.csv')
df

,Posted On,BHK,Rent,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,...,3.8,5.8,6.8,7.10,44..,7.11,77,77.1,77.2,7.12
0,5/18/2022,2,10000,1100,Ground out of 2,Super Area,Bandel,Kolkata,Unfurnished,Bachelors/Family,...,fe,e,e,o,e,e,e,o,e,e
1,5/13/2022,2,20000,800,1 out of 3,Super Area,"Phool Bagan, Kankurgachi",Kolkata,Semi-Furnished,Bachelors/Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,5/16/2022,2,17000,1000,1 out of 3,Super Area,Salt Lake City Sector 2,Kolkata,Semi-Furnished,Bachelors/Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,7/4/2022,2,10000,800,1 out of 2,Super Area,Dumdum Park,Kolkata,Unfurnished,Bachelors/Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5/9/2022,2,7500,850,1 out of 2,Carpet Area,South Dum Dum,Kolkata,Unfurnished,Bachelors,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4741,5/18/2022,2,15000,1000,3 out of 5,Carpet Area,Bandam Kommu,Hyderabad,Semi-Furnished,Bachelors/Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4742,5/15/2022,3,29000,2000,1 out of 4,Super Area,"Manikonda, Hyderabad",Hyderabad,Semi-Furnished,Bachelors/Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4743,7/10/2022,3,35000,1750,3 out of 5,Carpet Area,"Himayath Nagar, NH 7",Hyderabad,Semi-Furnished,Bachelors/Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4744,7/6/2022,3,45000,1500,23 out of 34,Carpet Area,Gachibowli,Hyderabad,Semi-Furnished,Family,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4745,5/4/2022,2,15000,1000,4 out of 5,Carpet Area,Suchitra Circle,Hyderabad,Unfurnished,Bachelors,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
df=pd.read_csv(r"C:\Users\sri44\Desktop\SH\file.csv")
df.appply(function)

AttributeError: 'DataFrame' object has no attribute 'appply'

In [ ]:
df

In [47]:
df.iloc[1]

AttributeError: 'str' object has no attribute 'iloc'

In [109]:
df.loc[4444,"City"]

'Hyderabad'

In [63]:
df.loc[2]

Posted On                          5/16/2022
BHK                                        2
Rent                                   17000
Size                                    1000
Floor                             1 out of 3
Area Type                         Super Area
Area Locality        Salt Lake City Sector 2
City                                 Kolkata
Furnishing Status             Semi-Furnished
Tenant Preferred            Bachelors/Family
Bathroom                                   1
Point of Contact               Contact Owner
Name: 2, dtype: object

In [ ]:
df[df['Rent'] > 20000,[City]]      # Age greater than 28
# df[df['City'] == 'Delhi']

,Posted On,BHK,Rent,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,Bathroom,Point of Contact
8,6/7/2022,2,26000,800,1 out of 2,Carpet Area,"Palm Avenue Kolkata, Ballygunge",Kolkata,Unfurnished,Bachelors,2,Contact Agent
10,5/23/2022,3,25000,1200,1 out of 4,Carpet Area,"Action Area 1, Rajarhat Newtown",Kolkata,Semi-Furnished,Bachelors/Family,2,Contact Agent
15,6/1/2022,3,40000,1286,1 out of 1,Carpet Area,New Town Action Area 1,Kolkata,Furnished,Bachelors/Family,2,Contact Owner
34,5/10/2022,3,22000,1100,2 out of 3,Carpet Area,Dumdum Park,Kolkata,Unfurnished,Bachelors/Family,1,Contact Owner
38,6/10/2022,2,21000,900,1 out of 2,Carpet Area,Bansdroni,Kolkata,Semi-Furnished,Bachelors,2,Contact Owner
...,...,...,...,...,...,...,...,...,...,...,...,...
4735,6/8/2022,3,35000,1250,4 out of 5,Super Area,Raj Bhawan Road,Hyderabad,Furnished,Bachelors,2,Contact Owner
4739,7/6/2022,2,25000,1040,2 out of 4,Carpet Area,Gachibowli,Hyderabad,Unfurnished,Bachelors,2,Contact Owner
4742,5/15/2022,3,29000,2000,1 out of 4,Super Area,"Manikonda, Hyderabad",Hyderabad,Semi-Furnished,Bachelors/Family,3,Contact Owner
4743,7/10/2022,3,35000,1750,3 out of 5,Carpet Area,"Himayath Nagar, NH 7",Hyderabad,Semi-Furnished,Bachelors/Family,3,Contact Agent
4744,7/6/2022,3,45000,1500,23 out of 34,Carpet Area,Gachibowli,Hyderabad,Semi-Furnished,Family,2,Contact Agent

In [ ]:
df['Age+5'] = df['Age'] + 5
df.groupby('City')['Age'].mean()
pd.merge(df1, df2, on='Name')
df.dropna()             # Remove missing rows
df.fillna(0)            # Replace missing with 0
ðŸ“¥ Data Input/Output
pd.read_csv() â†’ Read CSV file into DataFrame

pd.read_excel() â†’ Read Excel file

pd.read_sql() â†’ Read from SQL database

df.to_csv() â†’ Save DataFrame to CSV

df.to_excel() â†’ Save DataFrame to Excel

ðŸ” Data Exploration
df.head() â†’ First 5 rows

df.tail() â†’ Last 5 rows

df.info() â†’ Column types + non-null counts

df.describe() â†’ Summary statistics (mean, std, min, max)

df.shape â†’ Dimensions (rows, columns)

df.columns â†’ Column names

ðŸŽ¯ Selection & Indexing
df['col'] â†’ Select single column

df[['col1','col2']] â†’ Select multiple columns

df.iloc[0] â†’ Select row by index position

df.loc[2,'col'] â†’ Select row by label + column

df.at[2,'col'] â†’ Fast access for single value

ðŸ”Ž Filtering
df[df['Age'] > 30] â†’ Filter rows by condition

df.query("Age > 30 & City == 'Delhi'") â†’ SQL-like queries

ðŸ› ï¸ Data Cleaning
df.dropna() â†’ Remove missing values

df.fillna(0) â†’ Replace missing values

df.drop_duplicates() â†’ Remove duplicate rows

df.rename(columns={'old':'new'}) â†’ Rename columns

df.astype(float) â†’ Change data type

âž• Column Operations
df['new'] = df['Age'] + 5 â†’ Create new column

df.apply(func) â†’ Apply function to rows/columns

df.map(func) â†’ Apply function to Series

ðŸ“Š Grouping & Aggregation
df.groupby('City')['Age'].mean() â†’ Group by City, average Age

df.agg({'Age':'mean','Salary':'sum'}) â†’ Multiple aggregations

df.pivot_table(values='Age', index='City', aggfunc='mean') â†’ Pivot tables

ðŸ”— Merging & Joining
pd.concat([df1, df2]) â†’ Stack DataFrames

pd.merge(df1, df2, on='id') â†’ SQL-style join

ðŸ“ˆ Sorting
df.sort_values('Age') â†’ Sort by column

df.sort_index() â†’ Sort by index

ðŸ”„ Reshaping
df.melt() â†’ Unpivot DataFrame

df.pivot() â†’ Pivot DataFrame

df.stack() / df.unstack() â†’ Reshape hierarchical indexes

ðŸ§® Statistics
df.mean() â†’ Column means

df.median() â†’ Column medians

df.std() â†’ Standard deviation

df.value_counts() â†’ Frequency counts

ðŸ•’ Time Series
pd.to_datetime(df['date']) â†’ Convert to datetime

df.resample('M').mean() â†’ Resample by month
df.to_string() -> to print entire data frame

SyntaxError: invalid character 'ðŸ“¥' (U+1F4E5) (1307403230.py, line 6)

In [153]:
pd.concat(["City","Area Locality"])

TypeError: cannot concatenate object of type '<class 'str'>'; only Series and DataFrame objs are valid

In [ ]:
print(df[])

      Posted On  BHK   Rent  Size            Floor    Area Type  \
0     5/18/2022    2  10000  1100  Ground out of 2   Super Area
1     5/13/2022    2  20000   800       1 out of 3   Super Area
2     5/16/2022    2  17000  1000       1 out of 3   Super Area
3      7/4/2022    2  10000   800       1 out of 2   Super Area
4      5/9/2022    2   7500   850       1 out of 2  Carpet Area
...         ...  ...    ...   ...              ...          ...
4741  5/18/2022    2  15000  1000       3 out of 5  Carpet Area
4742  5/15/2022    3  29000  2000       1 out of 4   Super Area
4743  7/10/2022    3  35000  1750       3 out of 5  Carpet Area
4744   7/6/2022    3  45000  1500     23 out of 34  Carpet Area
4745   5/4/2022    2  15000  1000       4 out of 5  Carpet Area

                 Area Locality       City Furnishing Status  Tenant Preferred  \
0                       Bandel    Kolkata       Unfurnished  Bachelors/Family
1     Phool Bagan, Kankurgachi    Kolkata    Semi-Furnished  Bachelors/Family
2      Salt Lake City Sector 2    Kolkata    Semi-Furnished  Bachelors/Family
3                  Dumdum Park    Kolkata       Unfurnished  Bachelors/Family
4                South Dum Dum    Kolkata       Unfurnished         Bachelors
...                        ...        ...               ...               ...
4741              Bandam Kommu  Hyderabad    Semi-Furnished  Bachelors/Family
4742      Manikonda, Hyderabad  Hyderabad    Semi-Furnished  Bachelors/Family
4743      Himayath Nagar, NH 7  Hyderabad    Semi-Furnished  Bachelors/Family
4744                Gachibowli  Hyderabad    Semi-Furnished            Family
4745           Suchitra Circle  Hyderabad       Unfurnished         Bachelors

      Bathroom Point of Contact
0            2    Contact Owner
1            1    Contact Owner
2            1    Contact Owner
3            1    Contact Owner
4            1    Contact Owner
...        ...              ...
4741         2    Contact Owner
4742         3    Contact Owner
4743         3    Contact Agent
4744         2    Contact Agent
4745         2    Contact Owner

[4746 rows x 12 columns]

In [ ]:
df.pivot(1,"city",) 
+

TypeError: DataFrame.pivot() takes 1 positional argument but 3 were given

In [154]:
print("hello world")

hello world

In [ ]:
prices = {"apple": 0.50, "banana": 0.30, "orange": 0.60, "grape": 2.00}

# Print each fruit and its price in the format: "apple costs $0.50"


for i in prices.items():
    print(i[0],"cost$",i[1])

apple cost$ apple
banana cost$ banana
orange cost$ orange
grape cost$ grape